#include <stdio.h>

/*
- 指向一维数组的指针
	1，数组名就是数组的首地址，
		int a[] = { 1, 2, 3 }; 
		a == &a[0] 两者都是地址常量
		a[1] == *(a + 1) 两者访问的是一块数据
		注意：1，a是常量不能再次赋值（如a++），int* p = a; 这个p是变量，可以++。
			  2，*(a + i) == *(首地址 + i * 元素大小)。其不是一个简单的 *(首地址 + i)。
	2，访问数组元素
		下标形式：a[i] / p[i]
		指针形式：*(a+i) / *(p+i)
		注意：指针形式给数组元素赋值实乃不会 ：）
- 指向二维数组的指针
	1，数组的首地址：a，a[0]，&a[0][0]。
	2，a[i] == *(a+i)，表示第i行的首地址，既 a[i][0]的地址，
		既 a[i] == *(a+i) == &a[i][0]。
	3，a[i][j] 的地址 &a[i][j] == *(a+i)+j，既 a[i][j] == *( *(a+i)+j )。

- 数组名作为函数的参数，其实传递的是数组的首地址（指针常量），形式参数其实是一个指针变量。

*/

int main() {
	//// 指针访问数组元素
	//int a[6] = { 1,2,3,4,5,6 }, * p, i;
	//p = a;
	//printf("a[i] \t *(a+i) \t *(p+i) \n");
	//for (i = 0; i < 6; i++)
	//{
	//	printf("%d \t %d \t %d \n", a[i], *(a + i), *(p + i));
	//}
	//
	//int b[3], * bp, bi;
	//bp = b;
	//int* bp2 = b;
	//for ( bi = 0; bi < 3; bi++)
	//{
	//	scanf("%d", bp++);
	//}
	//for ( bi = 0; bi < 3; bi++)
	//{
	//	printf("%d \n", *(bp2++));
	//}

	// 指向二维数组a[m][n]的指针（列指针方式）
	//int columnArr[2][3], * columnP, i, j;
	//columnP = columnArr; // 用列地址初始化 TODO:啥意思
	//columnArr[0][0] = 11;
	//columnArr[0][1] = 12;
	//columnArr[0][2] = 13;
	//columnArr[1][0] = 21;
	//columnArr[1][1] = 22;
	//columnArr[1][2] = 23;
	//for ( i = 0; i < 2; i++){
	//	for (j = 0; j < 3; j++) {
	//		/*
	//		* 元素相对于首地址的偏移量：i*n+j
	//			11 12 13
	//			21 22 23
	//			i：第几行	n：一行几个元素		j：当前遍历到第i列的第j个元素
	//			i*n+j == 行号 * 每行几个元素 + a[i][j]是这列的第几个元素。
	//		*/
	//		printf("%d \n", *(columnP + i * 3 + j));
	//	}
	//}


	// 指向二维数组a[m][n]的指针（行指针方式）
	int rowArr[2][3], (*rowP)[3], i, j;
	rowP = rowArr; // 用行地址初始化 TODO:啥意思
	rowArr[0][0] = 11;
	rowArr[0][1] = 12;
	rowArr[0][2] = 13;
	rowArr[1][0] = 21;
	rowArr[1][1] = 22;
	rowArr[1][2] = 23;
	for ( i = 0; i < 2; i++){
		for (j = 0; j < 3; j++) {
			printf("%d \n", *(*(rowP + i) + j));
		}
	}


	return 0;
}